In [4]:
import pandas as pd

# Measurement Info

In [5]:
measurement = pd.read_csv("Measurement_info.csv")
#pd.set_option('display.max_columns', None)
measurement.sample(5)

,Measurement date,Station code,Item code,Average value,Instrument status
483025,2017-05-15 04:00,105,3,0.027,0
1642685,2018-04-02 07:00,106,9,37.000,0
3150885,2019-06-06 12:00,114,9,43.000,0
3004929,2019-04-25 00:00,113,1,0.004,0
1905901,2018-06-14 10:00,101,3,0.025,0

In [24]:
measurement.columns

Index(['Measurement date', 'Station code', 'Item code', 'Average value',
       'Instrument status'],
      dtype='object')

In [6]:
measurement.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3885066 entries, 0 to 3885065
Data columns (total 5 columns):
 #   Column             Dtype
---  ------             -----
 0   Measurement date   object
 1   Station code       int64
 2   Item code          int64
 3   Average value      float64
 4   Instrument status  int64
dtypes: float64(1), int64(3), object(1)
memory usage: 148.2+ MB

In [7]:
measurement.describe()

       Station code     Item code  Average value  Instrument status
count  3.885066e+06  3.885066e+06   3.885066e+06       3.885066e+06
mean   1.130002e+02  5.333333e+00   1.161132e+01       1.471890e-01
std    7.211310e+00  2.748737e+00   3.816098e+01       1.021642e+00
min    1.010000e+02  1.000000e+00  -1.000000e+00       0.000000e+00
25%    1.070000e+02  3.000000e+00   1.200000e-02       0.000000e+00
50%    1.130000e+02  5.500000e+00   7.000000e-02       0.000000e+00
75%    1.190000e+02  8.000000e+00   1.500000e+01       0.000000e+00
max    1.250000e+02  9.000000e+00   6.256000e+03       9.000000e+00

In [27]:
measurement.describe(include="object")

        Measurement date
count            3885066
unique             25906
top     2017-01-01 00:00
freq                 150

In [28]:
measurement.isnull().sum().sort_values(ascending=False)/len(measurement)*100

Measurement date     0.0
Station code         0.0
Item code            0.0
Average value        0.0
Instrument status    0.0
dtype: float64

In [29]:
measurement[measurement.duplicated()]

Empty DataFrame
Columns: [Measurement date, Station code, Item code, Average value, Instrument status]
Index: []

## Measurement Info (sample dataframe)

Dibuat untuk mengatasi keterbatasan penyimpanan di github

In [14]:
#measurement_sample = measurement.sample(frac=0.4, random_state=1)
#measurement_sample.to_csv('measurement_sample.csv', index=False)
#measurement_sample

# Measurement Item

In [12]:
measurement_item = pd.read_csv("Measurement_item_info.csv")
#pd.set_option('display.max_columns', None)
measurement_item.sample(6)

,Item code,Item name,Unit of measurement,Good(Blue),Normal(Green),Bad(Yellow),Very bad(Red)
1,3,NO2,ppm,0.03,0.06,0.20,2.0
2,5,CO,ppm,2.00,9.00,15.00,50.0
3,6,O3,ppm,0.03,0.09,0.15,0.5
5,9,PM2.5,Mircrogram/m3,15.00,35.00,75.00,500.0
4,8,PM10,Mircrogram/m3,30.00,80.00,150.00,600.0
0,1,SO2,ppm,0.02,0.05,0.15,1.0

In [34]:
measurement_item.columns

Index(['Item code', 'Item name', 'Unit of measurement', 'Good(Blue)',
       'Normal(Green)', 'Bad(Yellow)', 'Very bad(Red)'],
      dtype='object')

In [35]:
measurement_item.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 7 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Item code            6 non-null      int64
 1   Item name            6 non-null      object
 2   Unit of measurement  6 non-null      object
 3   Good(Blue)           6 non-null      float64
 4   Normal(Green)        6 non-null      float64
 5   Bad(Yellow)          6 non-null      float64
 6   Very bad(Red)        6 non-null      float64
dtypes: float64(4), int64(1), object(2)
memory usage: 464.0+ bytes

In [36]:
measurement_item.describe()

       Item code  Good(Blue)  Normal(Green)  Bad(Yellow)  Very bad(Red)
count   6.000000    6.000000       6.000000     6.000000       6.000000
mean    5.333333    7.846667      20.700000    40.083333     192.250000
std     3.011091   12.325430      32.047072    61.171960     279.551382
min     1.000000    0.020000       0.050000     0.150000       0.500000
25%     3.500000    0.030000       0.067500     0.162500       1.250000
50%     5.500000    1.015000       4.545000     7.600000      26.000000
75%     7.500000   11.750000      28.500000    60.000000     387.500000
max     9.000000   30.000000      80.000000   150.000000     600.000000

In [37]:
measurement_item.describe(include="object")

       Item name Unit of measurement
count          6                   6
unique         6                   2
top          SO2                 ppm
freq           1                   4

In [38]:
measurement_item.isnull().sum().sort_values(ascending=False)/len(measurement_item)*100

Item code              0.0
Item name              0.0
Unit of measurement    0.0
Good(Blue)             0.0
Normal(Green)          0.0
Bad(Yellow)            0.0
Very bad(Red)          0.0
dtype: float64

# Measurement Station

In [39]:
station = pd.read_csv("Measurement_station_info.csv")
#pd.set_option('display.max_columns', None)
station.sample(5)

,Station code,Station name(district),Address,Latitude,Longitude
14,115,Yangcheon-gu,"56, Jungang-ro 52-gil, Yangcheon-gu, Seoul, Re...",37.525939,126.856603
19,120,Dongjak-gu,"6, Sadang-ro 16a-gil, Dongjak-gu, Seoul, Repub...",37.480917,126.971481
21,122,Seocho-gu,"16, Sinbanpo-ro 15-gil, Seocho-gu, Seoul, Repu...",37.504547,126.994458
12,113,Dobong-gu,"34, Sirubong-ro 2-gil, Dobong-gu, Seoul, Repub...",37.654192,127.029088
8,109,Dongdaemun-gu,"43, Cheonho-daero 13-gil, Dongdaemun-gu, Seoul...",37.575743,127.028885

In [40]:
station.columns

Index(['Station code', 'Station name(district)', 'Address', 'Latitude',
       'Longitude'],
      dtype='object')

In [41]:
station.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Station code            25 non-null     int64
 1   Station name(district)  25 non-null     object
 2   Address                 25 non-null     object
 3   Latitude                25 non-null     float64
 4   Longitude               25 non-null     float64
dtypes: float64(2), int64(1), object(2)
memory usage: 1.1+ KB

In [42]:
station.describe()

       Station code   Latitude   Longitude
count     25.000000  25.000000   25.000000
mean     113.000000  37.553486  126.989339
std        7.359801   0.054373    0.080413
min      101.000000  37.452357  126.835151
25%      107.000000  37.517528  126.927102
50%      113.000000  37.544962  127.004850
75%      119.000000  37.584848  127.047470
max      125.000000  37.658774  127.136792

In [43]:
station.describe(include="object")

,Station name(district),Address
count,25,25
unique,25,25
top,Jongno-gu,"19, Jong-ro 35ga-gil, Jongno-gu, Seoul, Republ..."
freq,1,1

In [44]:
station.isnull().sum().sort_values(ascending=False)/len(station)*100

Station code              0.0
Station name(district)    0.0
Address                   0.0
Latitude                  0.0
Longitude                 0.0
dtype: float64